docs: added ER Diagram
